tests/load-testing/load-test.yaml
config:
  target: 'http://localhost:5001'
  phases:
    - duration: 60  # Durasi pengujian (dalam detik)
      arrivalRate: 10  # Permintaan per detik
scenarios:
  - flow:
      - post:
          url: "/login"
          json:
            username: "test_user"
            password: "test_password"
      - post:
          url: "/add"
          json:
            name: "Painting1"
            description: "A Beautiful Painting"
      - get:
          url: "/items"